
tap 'caskroom/cask'
tap 'caskroom/drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'
tap 'getantibody/tap'

cask_args appdir: '/Applications'
cask '1password'
cask 'aerial'
# cask 'airserver'
cask 'alfred'
cask 'backblaze'
cask 'basictex'
cask 'brave-browser'
cask 'carbon-copy-cloner'
cask 'charles'
cask 'cleanmymac'
cask 'colloquy'
cask 'docker'
cask 'dropbox'
cask 'font-fontawesome'
cask 'font-source-code-pro'
# cask 'font-source-code-pro-for-powerline'
cask 'firefox'
cask 'garmin-express'
cask 'google-chrome'
cask 'istat-menus'
cask 'iterm2'
cask 'java'
# cask 'jce-unlimited-strength-policy'
cask 'jetbrains-toolbox'
cask 'karabiner-elements'
cask 'microsoft-office'
cask 'omnigraffle'
cask 'onedrive'
cask 'pock'
cask 'postman'
cask 'quickbooks-online'
cask 'quicken'
cask 'slack'
# cask 'steam'
cask 'the-unarchiver'
cask 'tunnelblick'
# cask 'visualvm'
cask 'visual-studio-code'
cask 'vlc'
cask 'wireshark'

brew 'ack'
brew 'antibody'
brew 'awscli'
brew 'bash'
brew 'coreutils'
brew 'dep'
brew 'fzf'
brew 'gdbm'
brew 'git'
brew 'go'
brew 'kubectx', args: ["ignore-dependencies"]
# brew 'kubernetes-cli'
# brew 'kubernetes-helm'
brew 'jq'
brew 'lua@5.1'
brew 'python3'
brew 'mackup'
brew 'make'
brew 'mas'
# brew 'maven'
brew 'mercurial'
brew 'nats-streaming-server'
brew 'node'
brew 'npm'
brew 'openssl'
brew 'pandoc'
brew 'postgresql'
brew 'prometheus'
brew 'rbenv'
brew 'redis'
brew 'rpm'
brew 'ruby'
# brew 'sbt'
# brew 'scala'
brew 'tig'
brew 'unison'
brew 'vim'
brew 'wget'
brew 'zsh'

mas 'Things', id: 904280696
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Omnigraffle', id: 1142578753
mas 'Pages', id: 409201541
mas 'Pixelmator', id: 407963104
mas 'Transmit', id: 403388562
mas 'Tweetbot', id: 557168941
mas 'Xcode', id: 497799835
