
cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/drivers'
tap 'caskroom/fonts'

cask 'java'

brew 'awscli'
brew 'coreutils'
brew 'gdbm'
brew 'git'
brew 'go'
# brew 'kubernetes-cli'
# brew 'kubernetes-helm'
brew 'jq'
brew 'lua@5.1'
brew 'python3'
brew 'mackup'
brew 'mas'
brew 'maven'
brew 'mercurial'
brew 'npm'
brew 'openssl'
brew 'pandoc'
brew 'postgresql@10'
brew 'rbenv'
brew 'redis'
brew 'rpm'
brew 'ruby'
brew 'sbt'
brew 'scala'
brew 'tig'
brew 'vim'
brew 'zsh'
brew 'zsh-completions'

cask '1password'
cask 'airserver'
cask 'alfred'
cask 'backblaze'
cask 'bartender'
cask 'basictex'
cask 'carbon-copy-cloner'
cask 'charles'
cask 'cleanmymac'
cask 'colloquy'
cask 'docker'
# cask 'dropbox'
cask 'garmin-express'
cask 'google-chrome'
cask 'istat-menus'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'microsoft-office'
cask 'omnigraffle'
cask 'onedrive'
cask 'postman'
cask 'quickbooks'
cask 'quicken'
cask 'slack'
cask 'the-unarchiver'
cask 'tunnelblick'
cask 'visualvm'
cask 'visual-studio-code'
cask 'vlc'
cask 'wireshark'

cask 'font-source-code-pro'

mas 'Things', id: 904280696
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pixelmator' id: 407963104
mas 'Transmit', id: 403388562
mas 'Tweetbot', id: 557168941
mas 'Xcode', id: 497799835