
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'
tap 'getantibody/tap'

cask_args appdir: '/Applications'

cask '1password'
cask 'aerial'
cask 'alfred'
cask 'backblaze'
cask 'basictex'
cask 'carbon-copy-cloner'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'font-cascadia-code'
cask 'font-cascadia-code-pl'
cask 'font-fontawesome'
cask 'font-jetbrains-mono'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'google-chrome'
cask 'istat-menus'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'microsoft-office'
cask 'omnigraffle'
cask 'onyx'
cask 'postman'
cask 'quickbooks-online'
cask 'quicken'
cask 'slack'
cask 'the-unarchiver'
cask 'transmit'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'xquartz'
cask 'xscope'

brew 'ack'
brew 'antibody'
brew 'awscli'
brew 'bash'
brew 'coreutils'
brew 'curl'
brew 'fzf'
brew 'gawk'
brew 'gdbm'
brew 'git'
brew 'git-extras'
brew 'go'
brew 'golangci-lint'
brew 'httpie'
brew 'java'
brew 'jq'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'lua@5.1'
brew 'python3'
brew 'mackup'
brew 'make'
brew 'mas'
brew 'mercurial'
brew 'mkcert'
brew 'nats-server'
brew 'neovim'
brew 'node'
brew 'npm'
brew 'openssl'
brew 'pandoc'
brew 'postgis'
brew 'postgresql', restart_service: :changed
brew 'prettier'
brew 'prometheus'
brew 'python'
brew 'rpm'
brew 'ruby'
brew 'stow'
brew 'sqlite'
brew 'tig'
brew 'traefik'
brew 'unison'
brew 'yarn'
brew 'yq'
brew 'zsh'

mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pixelmator Pro', id: 1289583905
mas 'Things', id: 904280696
mas 'Xcode', id: 497799835
